Revit 2024 API
Element.GetEntitySchemaGuids Method
 Returns the Schema guids of any Entities stored in this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<Guid> GetEntitySchemaGuids()
Visual Basic
Public Function GetEntitySchemaGuids As IList(Of Guid)
Visual C++
public:
IList<Guid>^ GetEntitySchemaGuids()
Return Value
 The schema Entity guids.
See Also
Element Class
Autodesk.Revit.DB Namespace